PROP/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# - meshing

runApplication blockMesh

runApplication surfaceFeatures

runApplication snappyHexMesh -overwrite


# - create the inlet/outlet and AMI patches
runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

# Renumbering
runApplication renumberMesh -noFields -overwrite


# - set the initial fields
cp -rf 0.orig 0